RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_rtca.h
/**
  *******************************************************************************************************
  * @file    fm33lg0xx_fl_rtca.h
  * @author  FMSH Application Team
  * @brief   Head file of RTCA FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * You may obtain a copy of Mulan PSL v2 at:
  *          http://license.coscl.org.cn/MulanPSL2
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LG0XX_FL_RTCA_H
#define __FM33LG0XX_FL_RTCA_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lg0xx_fl_def.h"
/** @addtogroup FM33LG0XX_FL_Driver
  * @{
  */

/** @defgroup RTCA RTCA
  * @brief RTCA FL driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup RTCA_FL_ES_INIT RTCA Exported Init structures
  * @{
  */

/**
  * @brief FL RTCA Init Sturcture definition
  */
typedef struct
{
    /** 年 */
    uint32_t year;
    /** 月 */
    uint32_t month;
    /** 日 */
    uint32_t day;
    /** 周 */
    uint32_t week;
    /** 时 */
    uint32_t hour;
    /** 分 */
    uint32_t minute;
    /** 秒 */
    uint32_t second;

} FL_RTCA_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup RTCA_FL_Exported_Constants RTCA Exported Constants
  * @{
  */

#define    RTCA_IER_ADJ_IE_Pos                                    (12U)
#define    RTCA_IER_ADJ_IE_Msk                                    (0x1U << RTCA_IER_ADJ_IE_Pos)
#define    RTCA_IER_ADJ_IE                                        RTCA_IER_ADJ_IE_Msk

#define    RTCA_IER_ALARM_IE_Pos                                  (11U)
#define    RTCA_IER_ALARM_IE_Msk                                  (0x1U << RTCA_IER_ALARM_IE_Pos)
#define    RTCA_IER_ALARM_IE                                      RTCA_IER_ALARM_IE_Msk

#define    RTCA_IER_1KHZ_IE_Pos                                   (10U)
#define    RTCA_IER_1KHZ_IE_Msk                                   (0x1U << RTCA_IER_1KHZ_IE_Pos)
#define    RTCA_IER_1KHZ_IE                                       RTCA_IER_1KHZ_IE_Msk

#define    RTCA_IER_256HZ_IE_Pos                                  (9U)
#define    RTCA_IER_256HZ_IE_Msk                                  (0x1U << RTCA_IER_256HZ_IE_Pos)
#define    RTCA_IER_256HZ_IE                                      RTCA_IER_256HZ_IE_Msk

#define    RTCA_IER_64HZ_IE_Pos                                   (8U)
#define    RTCA_IER_64HZ_IE_Msk                                   (0x1U << RTCA_IER_64HZ_IE_Pos)
#define    RTCA_IER_64HZ_IE                                       RTCA_IER_64HZ_IE_Msk

#define    RTCA_IER_16HZ_IE_Pos                                   (7U)
#define    RTCA_IER_16HZ_IE_Msk                                   (0x1U << RTCA_IER_16HZ_IE_Pos)
#define    RTCA_IER_16HZ_IE                                       RTCA_IER_16HZ_IE_Msk

#define    RTCA_IER_8HZ_IE_Pos                                    (6U)
#define    RTCA_IER_8HZ_IE_Msk                                    (0x1U << RTCA_IER_8HZ_IE_Pos)
#define    RTCA_IER_8HZ_IE                                        RTCA_IER_8HZ_IE_Msk

#define    RTCA_IER_4HZ_IE_Pos                                    (5U)
#define    RTCA_IER_4HZ_IE_Msk                                    (0x1U << RTCA_IER_4HZ_IE_Pos)
#define    RTCA_IER_4HZ_IE                                        RTCA_IER_4HZ_IE_Msk

#define    RTCA_IER_2HZ_IE_Pos                                    (4U)
#define    RTCA_IER_2HZ_IE_Msk                                    (0x1U << RTCA_IER_2HZ_IE_Pos)
#define    RTCA_IER_2HZ_IE                                        RTCA_IER_2HZ_IE_Msk

#define    RTCA_IER_SEC_IE_Pos                                    (3U)
#define    RTCA_IER_SEC_IE_Msk                                    (0x1U << RTCA_IER_SEC_IE_Pos)
#define    RTCA_IER_SEC_IE                                        RTCA_IER_SEC_IE_Msk

#define    RTCA_IER_MIN_IE_Pos                                    (2U)
#define    RTCA_IER_MIN_IE_Msk                                    (0x1U << RTCA_IER_MIN_IE_Pos)
#define    RTCA_IER_MIN_IE                                        RTCA_IER_MIN_IE_Msk

#define    RTCA_IER_HOUR_IE_Pos                                   (1U)
#define    RTCA_IER_HOUR_IE_Msk                                   (0x1U << RTCA_IER_HOUR_IE_Pos)
#define    RTCA_IER_HOUR_IE                                       RTCA_IER_HOUR_IE_Msk

#define    RTCA_IER_DAY_IE_Pos                                    (0U)
#define    RTCA_IER_DAY_IE_Msk                                    (0x1U << RTCA_IER_DAY_IE_Pos)
#define    RTCA_IER_DAY_IE                                        RTCA_IER_DAY_IE_Msk

#define    RTCA_ISR_ADJ_IF_Pos                                    (12U)
#define    RTCA_ISR_ADJ_IF_Msk                                    (0x1U << RTCA_ISR_ADJ_IF_Pos)
#define    RTCA_ISR_ADJ_IF                                        RTCA_ISR_ADJ_IF_Msk

#define    RTCA_ISR_ALARM_IF_Pos                                  (11U)
#define    RTCA_ISR_ALARM_IF_Msk                                  (0x1U << RTCA_ISR_ALARM_IF_Pos)
#define    RTCA_ISR_ALARM_IF                                      RTCA_ISR_ALARM_IF_Msk

#define    RTCA_ISR_1KHZ_IF_Pos                                   (10U)
#define    RTCA_ISR_1KHZ_IF_Msk                                   (0x1U << RTCA_ISR_1KHZ_IF_Pos)
#define    RTCA_ISR_1KHZ_IF                                       RTCA_ISR_1KHZ_IF_Msk

#define    RTCA_ISR_256HZ_IF_Pos                                  (9U)
#define    RTCA_ISR_256HZ_IF_Msk                                  (0x1U << RTCA_ISR_256HZ_IF_Pos)
#define    RTCA_ISR_256HZ_IF                                      RTCA_ISR_256HZ_IF_Msk

#define    RTCA_ISR_64HZ_IF_Pos                                   (8U)
#define    RTCA_ISR_64HZ_IF_Msk                                   (0x1U << RTCA_ISR_64HZ_IF_Pos)
#define    RTCA_ISR_64HZ_IF                                       RTCA_ISR_64HZ_IF_Msk

