RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_rtca.h
#define    RTCA_ISR_16HZ_IF_Pos                                   (7U)
#define    RTCA_ISR_16HZ_IF_Msk                                   (0x1U << RTCA_ISR_16HZ_IF_Pos)
#define    RTCA_ISR_16HZ_IF                                       RTCA_ISR_16HZ_IF_Msk

#define    RTCA_ISR_8HZ_IF_Pos                                    (6U)
#define    RTCA_ISR_8HZ_IF_Msk                                    (0x1U << RTCA_ISR_8HZ_IF_Pos)
#define    RTCA_ISR_8HZ_IF                                        RTCA_ISR_8HZ_IF_Msk

#define    RTCA_ISR_4HZ_IF_Pos                                    (5U)
#define    RTCA_ISR_4HZ_IF_Msk                                    (0x1U << RTCA_ISR_4HZ_IF_Pos)
#define    RTCA_ISR_4HZ_IF                                        RTCA_ISR_4HZ_IF_Msk

#define    RTCA_ISR_2HZ_IF_Pos                                    (4U)
#define    RTCA_ISR_2HZ_IF_Msk                                    (0x1U << RTCA_ISR_2HZ_IF_Pos)
#define    RTCA_ISR_2HZ_IF                                        RTCA_ISR_2HZ_IF_Msk

#define    RTCA_ISR_SEC_IF_Pos                                    (3U)
#define    RTCA_ISR_SEC_IF_Msk                                    (0x1U << RTCA_ISR_SEC_IF_Pos)
#define    RTCA_ISR_SEC_IF                                        RTCA_ISR_SEC_IF_Msk

#define    RTCA_ISR_MIN_IF_Pos                                    (2U)
#define    RTCA_ISR_MIN_IF_Msk                                    (0x1U << RTCA_ISR_MIN_IF_Pos)
#define    RTCA_ISR_MIN_IF                                        RTCA_ISR_MIN_IF_Msk

#define    RTCA_ISR_HOUR_IF_Pos                                   (1U)
#define    RTCA_ISR_HOUR_IF_Msk                                   (0x1U << RTCA_ISR_HOUR_IF_Pos)
#define    RTCA_ISR_HOUR_IF                                       RTCA_ISR_HOUR_IF_Msk

#define    RTCA_ISR_DAY_IF_Pos                                    (0U)
#define    RTCA_ISR_DAY_IF_Msk                                    (0x1U << RTCA_ISR_DAY_IF_Pos)
#define    RTCA_ISR_DAY_IF                                        RTCA_ISR_DAY_IF_Msk

#define    RTCA_TMSEL_TMSEL_Pos                                   (0U)
#define    RTCA_TMSEL_TMSEL_Msk                                   (0xfU << RTCA_TMSEL_TMSEL_Pos)
#define    RTCA_TMSEL_TMSEL                                       RTCA_TMSEL_TMSEL_Msk

#define    RTCA_ADJUST_ADSIGN_Pos                                 (9U)
#define    RTCA_ADJUST_ADSIGN_Msk                                 (0x1U << RTCA_ADJUST_ADSIGN_Pos)
#define    RTCA_ADJUST_ADSIGN                                     RTCA_ADJUST_ADSIGN_Msk

#define    RTCA_CR_EN_Pos                                         (0U)
#define    RTCA_CR_EN_Msk                                         (0x1U << RTCA_CR_EN_Pos)
#define    RTCA_CR_EN                                             RTCA_CR_EN_Msk






#define    FL_RTCA_TIME_MARK_SECOND                               (0x2U << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_MINUTE                               (0x3U << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_HOUR                                 (0x4U << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_DAY                                  (0x5U << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_ALARM                                (0x6U << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_32_SEC                               (0x7U << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_SECOND_REVERSE                       (0x9U << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_MINUTE_REVERSE                       (0xaU << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_HOUR_REVERSE                         (0xbU << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_DAY_REVERSE                          (0xcU << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_ALARM_REVERSE                        (0xdU << RTCA_TMSEL_TMSEL_Pos)
#define    FL_RTCA_TIME_MARK_SEC                                  (0xfU << RTCA_TMSEL_TMSEL_Pos)


#define    FL_RTCA_ADJUST_DIR_INCREASE                            (0x0U << RTCA_ADJUST_ADSIGN_Pos)
#define    FL_RTCA_ADJUST_DIR_DECREASE                            (0x1U << RTCA_ADJUST_ADSIGN_Pos)


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup RTCA_FL_Exported_Functions RTCA Exported Functions
  * @{
  */

/**
  * @brief    Enable RTCA Config Time
  * @rmtoll   WER        FL_RTCA_WriteEnable
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteEnable(RTCA_Type *RTCAx)
{
    RTCAx->WER = 0xACACACAC;
}

/**
  * @brief    Disable RTCA Config Time
  * @rmtoll   WER        FL_RTCA_WriteDisable
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteDisable(RTCA_Type *RTCAx)
{
    RTCAx->WER = 0x5A5A5A5A;
}

/**
  * @brief    Enable RTCA Time Adjust Interrupt
  * @rmtoll   IER    ADJ_IE    FL_RTCA_EnableIT_Adjust
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_Adjust(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_ADJ_IE_Msk);
}

/**
  * @brief    Get RTCA Time Adjust Interrupt Enable Status
  * @rmtoll   IER    ADJ_IE    FL_RTCA_IsEnabledIT_Adjust
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_Adjust(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_ADJ_IE_Msk) == RTCA_IER_ADJ_IE_Msk);
}

/**
  * @brief    Disable RTCA Time Adjust Interrupt
  * @rmtoll   IER    ADJ_IE    FL_RTCA_DisableIT_Adjust
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_Adjust(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_ADJ_IE_Msk);
}

/**
  * @brief    Enable RTCA Alarm Interrupt
  * @rmtoll   IER    ALARM_IE    FL_RTCA_EnableIT_Alarm
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_Alarm(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_ALARM_IE_Msk);
}

/**
  * @brief    Get RTCA Alarm Interrupt Enable Status
  * @rmtoll   IER    ALARM_IE    FL_RTCA_IsEnabledIT_Alarm
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_Alarm(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_ALARM_IE_Msk) == RTCA_IER_ALARM_IE_Msk);
}

/**
  * @brief    Disable RTCA Alarm    Interrupt
  * @rmtoll   IER    ALARM_IE    FL_RTCA_DisableIT_Alarm
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_Alarm(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_ALARM_IE_Msk);
}

/**
  * @brief    Enable RTCA 1KHz Interrupt
  * @rmtoll   IER    1KHZ_IE    FL_RTCA_EnableIT_1KHz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_1KHz(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_1KHZ_IE_Msk);
}

/**
  * @brief    Get RTCA 1KHz Interrupt Enable Status
  * @rmtoll   IER    1KHZ_IE    FL_RTCA_IsEnabledIT_1KHz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_1KHz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_1KHZ_IE_Msk) == RTCA_IER_1KHZ_IE_Msk);
}

/**
  * @brief    Disable RTCA 1KHz Interrupt
  * @rmtoll   IER    1KHZ_IE    FL_RTCA_DisableIT_1KHz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_1KHz(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_1KHZ_IE_Msk);
}

/**
  * @brief    Enable RTCA 256Hz Interrupt
  * @rmtoll   IER    256HZ_IE    FL_RTCA_EnableIT_256Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_256Hz(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_256HZ_IE_Msk);
}

/**
  * @brief    Get RTCA 256Hz Interrupt Enable Status
  * @rmtoll   IER    256HZ_IE    FL_RTCA_IsEnabledIT_256Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_256Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_256HZ_IE_Msk) == RTCA_IER_256HZ_IE_Msk);
}

/**
  * @brief    Disable RTCA 256Hz Interrupt
  * @rmtoll   IER    256HZ_IE    FL_RTCA_DisableIT_256Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_256Hz(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_256HZ_IE_Msk);
}

/**
  * @brief    Enable RTCA 64Hz Interrupt
  * @rmtoll   IER    64HZ_IE    FL_RTCA_EnableIT_64Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_64Hz(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_64HZ_IE_Msk);
}

/**
  * @brief    Get RTCA 64Hz Interrupt Enable Status
  * @rmtoll   IER    64HZ_IE    FL_RTCA_IsEnabledIT_64Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_64Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_64HZ_IE_Msk) == RTCA_IER_64HZ_IE_Msk);
}

/**
  * @brief    Disable RTCA 64Hz Interrupt
  * @rmtoll   IER    64HZ_IE    FL_RTCA_DisableIT_64Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_64Hz(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_64HZ_IE_Msk);
}

/**
  * @brief    Enable RTCA 16Hz Interrupt
  * @rmtoll   IER    16HZ_IE    FL_RTCA_EnableIT_16Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_16Hz(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_16HZ_IE_Msk);
}

/**
  * @brief    Get RTCA 16Hz Interrupt Enable Status
  * @rmtoll   IER    16HZ_IE    FL_RTCA_IsEnabledIT_16Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_16Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_16HZ_IE_Msk) == RTCA_IER_16HZ_IE_Msk);
}

/**
  * @brief    Disable RTCA 16Hz Interrupt
  * @rmtoll   IER    16HZ_IE    FL_RTCA_DisableIT_16Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_16Hz(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_16HZ_IE_Msk);
}

/**
  * @brief    Enable RTCA 8Hz Interrupt
  * @rmtoll   IER    8HZ_IE    FL_RTCA_EnableIT_8Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_8Hz(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_8HZ_IE_Msk);
}

/**
  * @brief    Get RTCA 8Hz Interrupt Enable Status
  * @rmtoll   IER    8HZ_IE    FL_RTCA_IsEnabledIT_8Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_8Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_8HZ_IE_Msk) == RTCA_IER_8HZ_IE_Msk);
}

/**
  * @brief    Disable RTCA 8Hz Interrupt
  * @rmtoll   IER    8HZ_IE    FL_RTCA_DisableIT_8Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_8Hz(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_8HZ_IE_Msk);
}

/**
  * @brief    Enable RTCA 4Hz Interrupt
  * @rmtoll   IER    4HZ_IE    FL_RTCA_EnableIT_4Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_4Hz(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_4HZ_IE_Msk);
}

/**
  * @brief    Get RTCA 4Hz Interrupt Enable Status
  * @rmtoll   IER    4HZ_IE    FL_RTCA_IsEnabledIT_4Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_4Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_4HZ_IE_Msk) == RTCA_IER_4HZ_IE_Msk);
}

/**
  * @brief    Disable RTCA 4Hz Interrupt
  * @rmtoll   IER    4HZ_IE    FL_RTCA_DisableIT_4Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_4Hz(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_4HZ_IE_Msk);
}

/**
  * @brief    Enable RTCA 2Hz Interrupt
  * @rmtoll   IER    2HZ_IE    FL_RTCA_EnableIT_2Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_2Hz(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_2HZ_IE_Msk);
}

/**
  * @brief    Get RTCA 2Hz Interrupt Enable Status
  * @rmtoll   IER    2HZ_IE    FL_RTCA_IsEnabledIT_2Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_2Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_2HZ_IE_Msk) == RTCA_IER_2HZ_IE_Msk);
}

/**
  * @brief    Disable RTCA 2Hz Interrupt
  * @rmtoll   IER    2HZ_IE    FL_RTCA_DisableIT_2Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_2Hz(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_2HZ_IE_Msk);
}

/**
  * @brief    Enable RTCA Second Interrupt
  * @rmtoll   IER    SEC_IE    FL_RTCA_EnableIT_Second
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_Second(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_SEC_IE_Msk);
}

/**
  * @brief    Get RTCA Second Interrupt Enable Status
  * @rmtoll   IER    SEC_IE    FL_RTCA_IsEnabledIT_Second
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_Second(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_SEC_IE_Msk) == RTCA_IER_SEC_IE_Msk);
}

/**
  * @brief    Disable RTCA Second Interrupt
  * @rmtoll   IER    SEC_IE    FL_RTCA_DisableIT_Second
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_Second(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_SEC_IE_Msk);
}

/**
  * @brief    Enable RTCA Minute Interrupt
  * @rmtoll   IER    MIN_IE    FL_RTCA_EnableIT_Minute
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_Minute(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_MIN_IE_Msk);
}

/**
  * @brief    Get RTCA Minute Interrupt Enable Status
  * @rmtoll   IER    MIN_IE    FL_RTCA_IsEnabledIT_Minute
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_Minute(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_MIN_IE_Msk) == RTCA_IER_MIN_IE_Msk);
}

/**
  * @brief    Disable RTCA Minute Interrupt
  * @rmtoll   IER    MIN_IE    FL_RTCA_DisableIT_Minute
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_Minute(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_MIN_IE_Msk);
}

/**
  * @brief    Enable RTCA Hour Interrupt
  * @rmtoll   IER    HOUR_IE    FL_RTCA_EnableIT_Hour
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_Hour(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_HOUR_IE_Msk);
}

/**
  * @brief    Get RTCA Hour Interrupt Enable Status
  * @rmtoll   IER    HOUR_IE    FL_RTCA_IsEnabledIT_Hour
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_Hour(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_HOUR_IE_Msk) == RTCA_IER_HOUR_IE_Msk);
}

/**
  * @brief    Disable RTCA Hour  Interrupt
  * @rmtoll   IER    HOUR_IE    FL_RTCA_DisableIT_Hour
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_Hour(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_HOUR_IE_Msk);
}

/**
  * @brief    Enable RTCA Day Interrupt
  * @rmtoll   IER    DAY_IE    FL_RTCA_EnableIT_Day
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_EnableIT_Day(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->IER, RTCA_IER_DAY_IE_Msk);
}

/**
  * @brief    Get RTCA Day Interrupt Enable Status
  * @rmtoll   IER    DAY_IE    FL_RTCA_IsEnabledIT_Day
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabledIT_Day(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->IER, RTCA_IER_DAY_IE_Msk) == RTCA_IER_DAY_IE_Msk);
}

/**
  * @brief    Disable RTCA Day Interrupt
  * @rmtoll   IER    DAY_IE    FL_RTCA_DisableIT_Day
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_DisableIT_Day(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->IER, RTCA_IER_DAY_IE_Msk);
}

/**
  * @brief    Clear RTCA Time Adjust Interrupt Flag
  * @rmtoll   ISR    ADJ_IF    FL_RTCA_ClearFlag_Adjust
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_Adjust(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_ADJ_IF_Msk);
}

/**
  * @brief    Get RTCA Time Adjust Interrupt Flag
  * @rmtoll   ISR    ADJ_IF    FL_RTCA_IsActiveFlag_Adjust
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_Adjust(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_ADJ_IF_Msk) == (RTCA_ISR_ADJ_IF_Msk));
}

/**
  * @brief    Clear RTCA Alarm Interrupt Flag
  * @rmtoll   ISR    ALARM_IF    FL_RTCA_ClearFlag_Alarm
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_Alarm(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_ALARM_IF_Msk);
}

/**
  * @brief    Get RTCA Alarm Interrupt Flag
  * @rmtoll   ISR    ALARM_IF    FL_RTCA_IsActiveFlag_Alarm
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_Alarm(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_ALARM_IF_Msk) == (RTCA_ISR_ALARM_IF_Msk));
}

/**
  * @brief    Clear RTCA 1KHz Interrupt Flag
  * @rmtoll   ISR    1KHZ_IF    FL_RTCA_ClearFlag_1KHz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_1KHz(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_1KHZ_IF_Msk);
}

/**
  * @brief    Get RTCA 1KHz Interrupt Flag
  * @rmtoll   ISR    1KHZ_IF    FL_RTCA_IsActiveFlag_1KHz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_1KHz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_1KHZ_IF_Msk) == (RTCA_ISR_1KHZ_IF_Msk));
}

/**
  * @brief    Clear RTCA 256Hz Interrupt Flag
  * @rmtoll   ISR    256HZ_IF    FL_RTCA_ClearFlag_256Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_256Hz(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_256HZ_IF_Msk);
}

/**
  * @brief    Get RTCA 256Hz Interrupt Flag
  * @rmtoll   ISR    256HZ_IF    FL_RTCA_IsActiveFlag_256Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_256Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_256HZ_IF_Msk) == (RTCA_ISR_256HZ_IF_Msk));
}

/**
  * @brief    Clear RTCA 64Hz Interrupt Flag
  * @rmtoll   ISR    64HZ_IF    FL_RTCA_ClearFlag_64Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_64Hz(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_64HZ_IF_Msk);
}

/**
  * @brief    Get RTCA 64Hz Interrupt Flag
  * @rmtoll   ISR    64HZ_IF    FL_RTCA_IsActiveFlag_64Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_64Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_64HZ_IF_Msk) == (RTCA_ISR_64HZ_IF_Msk));
}

/**
  * @brief    Clear RTCA 16Hz Interrupt Flag
  * @rmtoll   ISR    16HZ_IF    FL_RTCA_ClearFlag_16Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_16Hz(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_16HZ_IF_Msk);
}

/**
  * @brief    Get RTCA 16Hz Interrupt Flag
  * @rmtoll   ISR    16HZ_IF    FL_RTCA_IsActiveFlag_16Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_16Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_16HZ_IF_Msk) == (RTCA_ISR_16HZ_IF_Msk));
}

/**
  * @brief    Clear RTCA 8Hz Interrupt Flag
  * @rmtoll   ISR    8HZ_IF    FL_RTCA_ClearFlag_8Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_8Hz(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_8HZ_IF_Msk);
}

/**
  * @brief    Get RTCA 8Hz Interrupt Flag
  * @rmtoll   ISR    8HZ_IF    FL_RTCA_IsActiveFlag_8Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_8Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_8HZ_IF_Msk) == (RTCA_ISR_8HZ_IF_Msk));
}

/**
  * @brief    Clear RTCA 4Hz Interrupt Flag
  * @rmtoll   ISR    4HZ_IF    FL_RTCA_ClearFlag_4Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_4Hz(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_4HZ_IF_Msk);
}

/**
  * @brief    Get RTCA 4Hz Interrupt Flag
  * @rmtoll   ISR    4HZ_IF    FL_RTCA_IsActiveFlag_4Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_4Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_4HZ_IF_Msk) == (RTCA_ISR_4HZ_IF_Msk));
}

/**
  * @brief    Clear RTCA 2Hz Interrupt Flag
  * @rmtoll   ISR    2HZ_IF    FL_RTCA_ClearFlag_2Hz
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_2Hz(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_2HZ_IF_Msk);
}

/**
  * @brief    Get RTCA 2Hz Interrupt Flag
  * @rmtoll   ISR    2HZ_IF    FL_RTCA_IsActiveFlag_2Hz
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_2Hz(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_2HZ_IF_Msk) == (RTCA_ISR_2HZ_IF_Msk));
}

/**
  * @brief    Clear RTCA Second Interrupt Flag
  * @rmtoll   ISR    SEC_IF    FL_RTCA_ClearFlag_Second
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_Second(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_SEC_IF_Msk);
}

/**
  * @brief    Get RTCA Second Interrupt Flag
  * @rmtoll   ISR    SEC_IF    FL_RTCA_IsActiveFlag_Second
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_Second(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_SEC_IF_Msk) == (RTCA_ISR_SEC_IF_Msk));
}

/**
  * @brief    Clear RTCA Minute Interrupt Flag
  * @rmtoll   ISR    MIN_IF    FL_RTCA_ClearFlag_Minute
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_Minute(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_MIN_IF_Msk);
}

/**
  * @brief    Get RTCA Minute Interrupt Flag
  * @rmtoll   ISR    MIN_IF    FL_RTCA_IsActiveFlag_Minute
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_Minute(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_MIN_IF_Msk) == (RTCA_ISR_MIN_IF_Msk));
}

/**
  * @brief    Clear RTCA Hour Interrupt Flag
  * @rmtoll   ISR    HOUR_IF    FL_RTCA_ClearFlag_Hour
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_Hour(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_HOUR_IF_Msk);
}

