RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_rtca.h
/**
  * @brief    Get RTCA Hour Interrupt Flag
  * @rmtoll   ISR    HOUR_IF    FL_RTCA_IsActiveFlag_Hour
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_Hour(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_HOUR_IF_Msk) == (RTCA_ISR_HOUR_IF_Msk));
}

/**
  * @brief    Clear RTCA Day Interrupt Flag
  * @rmtoll   ISR    DAY_IF    FL_RTCA_ClearFlag_Day
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_ClearFlag_Day(RTCA_Type *RTCAx)
{
    WRITE_REG(RTCAx->ISR, RTCA_ISR_DAY_IF_Msk);
}

/**
  * @brief    Get RTCA Day Interrupt Flag
  * @rmtoll   ISR    DAY_IF    FL_RTCA_IsActiveFlag_Day
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsActiveFlag_Day(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ISR, RTCA_ISR_DAY_IF_Msk) == (RTCA_ISR_DAY_IF_Msk));
}

/**
  * @brief    Get RTCA Second Value
  * @rmtoll   BCDSEC        FL_RTCA_ReadSecond
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadSecond(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->BCDSEC, (0x7fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCA Second Value
  * @rmtoll   BCDSEC        FL_RTCA_WriteSecond
  * @param    RTCAx RTCA instance
  * @param    second
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteSecond(RTCA_Type *RTCAx, uint32_t second)
{
    MODIFY_REG(RTCAx->BCDSEC, (0x7fU << 0U), (second << 0U));
}

/**
  * @brief    Get RTCA Minute Value
  * @rmtoll   BCDMIN        FL_RTCA_ReadMinute
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadMinute(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->BCDMIN, (0x7fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCA Minute Value
  * @rmtoll   BCDMIN        FL_RTCA_WriteMinute
  * @param    RTCAx RTCA instance
  * @param    minute
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteMinute(RTCA_Type *RTCAx, uint32_t minute)
{
    MODIFY_REG(RTCAx->BCDMIN, (0x7fU << 0U), (minute << 0U));
}

/**
  * @brief    Get RTCA Hour Value
  * @rmtoll   BCDHOUR        FL_RTCA_ReadHour
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadHour(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->BCDHOUR, (0x3fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCA Hour Value
  * @rmtoll   BCDHOUR        FL_RTCA_WriteHour
  * @param    RTCAx RTCA instance
  * @param    hour
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteHour(RTCA_Type *RTCAx, uint32_t hour)
{
    MODIFY_REG(RTCAx->BCDHOUR, (0x3fU << 0U), (hour << 0U));
}

/**
  * @brief    Get RTCA Day Value
  * @rmtoll   BCDDAY        FL_RTCA_ReadDay
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadDay(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->BCDDAY, (0x3fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCA Day Value
  * @rmtoll   BCDDAY        FL_RTCA_WriteDay
  * @param    RTCAx RTCA instance
  * @param    day
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteDay(RTCA_Type *RTCAx, uint32_t day)
{
    MODIFY_REG(RTCAx->BCDDAY, (0x3fU << 0U), (day << 0U));
}

/**
  * @brief    Get RTCA Week Value
  * @rmtoll   BCDWEEK        FL_RTCA_ReadWeek
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadWeek(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->BCDWEEK, (0x7U << 0U)) >> 0U);
}

/**
  * @brief    Set RTCA Week Value
  * @rmtoll   BCDWEEK        FL_RTCA_WriteWeek
  * @param    RTCAx RTCA instance
  * @param    week
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteWeek(RTCA_Type *RTCAx, uint32_t week)
{
    MODIFY_REG(RTCAx->BCDWEEK, (0x7U << 0U), (week << 0U));
}

/**
  * @brief    Get RTCA Month Value
  * @rmtoll   BCDMONTH        FL_RTCA_ReadMonth
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadMonth(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->BCDMONTH, (0x1fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCA Month Value
  * @rmtoll   BCDMONTH        FL_RTCA_WriteMonth
  * @param    RTCAx RTCA instance
  * @param    month
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteMonth(RTCA_Type *RTCAx, uint32_t month)
{
    MODIFY_REG(RTCAx->BCDMONTH, (0x1fU << 0U), (month << 0U));
}

/**
  * @brief    Get RTCA Year Value
  * @rmtoll   BCDYEAR        FL_RTCA_ReadYear
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadYear(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->BCDYEAR, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCA Year Value
  * @rmtoll   BCDYEAR        FL_RTCA_WriteYear
  * @param    RTCAx RTCA instance
  * @param    year
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteYear(RTCA_Type *RTCAx, uint32_t year)
{
    MODIFY_REG(RTCAx->BCDYEAR, (0xffU << 0U), (year << 0U));
}

/**
  * @brief    Get RTCA Alarm Hour Value
  * @rmtoll   ALARM        FL_RTCA_ReadHourAlarm
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadHourAlarm(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ALARM, (0x3fU << 16U)) >> 16U);
}

/**
  * @brief    Set RTCA Alarm Hour Value
  * @rmtoll   ALARM        FL_RTCA_WriteHourAlarm
  * @param    RTCAx RTCA instance
  * @param    hour
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteHourAlarm(RTCA_Type *RTCAx, uint32_t hour)
{
    MODIFY_REG(RTCAx->ALARM, (0x3fU << 16U), (hour << 16U));
}

/**
  * @brief    Get RTCA Alarm Minute Value
  * @rmtoll   ALARM        FL_RTCA_ReadMinuteAlarm
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadMinuteAlarm(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ALARM, (0x7fU << 8U)) >> 8U);
}

/**
  * @brief    Set RTCA Alarm Minute Value
  * @rmtoll   ALARM        FL_RTCA_WriteMinuteAlarm
  * @param    RTCAx RTCA instance
  * @param    minute
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteMinuteAlarm(RTCA_Type *RTCAx, uint32_t minute)
{
    MODIFY_REG(RTCAx->ALARM, (0x7fU << 8U), (minute << 8U));
}

/**
  * @brief    Get RTCA Alarm Second Value
  * @rmtoll   ALARM        FL_RTCA_ReadSecondAlarm
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadSecondAlarm(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ALARM, (0x7fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCA Alarm Second Value
  * @rmtoll   ALARM        FL_RTCA_WriteSecondAlarm
  * @param    RTCAx RTCA instance
  * @param    second
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteSecondAlarm(RTCA_Type *RTCAx, uint32_t second)
{
    MODIFY_REG(RTCAx->ALARM, (0x7fU << 0U), (second << 0U));
}

/**
  * @brief    Set RTCA Output Time Mark Signal
  * @rmtoll   TMSEL    TMSEL    FL_RTCA_SetTimeMarkOutput
  * @param    RTCAx RTCA instance
  * @param    markSelect This parameter can be one of the following values:
  *           @arg @ref FL_RTCA_TIME_MARK_SECOND
  *           @arg @ref FL_RTCA_TIME_MARK_MINUTE
  *           @arg @ref FL_RTCA_TIME_MARK_HOUR
  *           @arg @ref FL_RTCA_TIME_MARK_DAY
  *           @arg @ref FL_RTCA_TIME_MARK_ALARM
  *           @arg @ref FL_RTCA_TIME_MARK_32_SEC
  *           @arg @ref FL_RTCA_TIME_MARK_SECOND_REVERSE
  *           @arg @ref FL_RTCA_TIME_MARK_MINUTE_REVERSE
  *           @arg @ref FL_RTCA_TIME_MARK_HOUR_REVERSE
  *           @arg @ref FL_RTCA_TIME_MARK_DAY_REVERSE
  *           @arg @ref FL_RTCA_TIME_MARK_ALARM_REVERSE
  *           @arg @ref FL_RTCA_TIME_MARK_SEC
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_SetTimeMarkOutput(RTCA_Type *RTCAx, uint32_t markSelect)
{
    MODIFY_REG(RTCAx->TMSEL, RTCA_TMSEL_TMSEL_Msk, markSelect);
}

/**
  * @brief    Get RTCA Output Time Mark Signal Setting
  * @rmtoll   TMSEL    TMSEL    FL_RTCA_GetTimeMarkOutput
  * @param    RTCAx RTCA instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_RTCA_TIME_MARK_SECOND
  *           @arg @ref FL_RTCA_TIME_MARK_MINUTE
  *           @arg @ref FL_RTCA_TIME_MARK_HOUR
  *           @arg @ref FL_RTCA_TIME_MARK_DAY
  *           @arg @ref FL_RTCA_TIME_MARK_ALARM
  *           @arg @ref FL_RTCA_TIME_MARK_32_SEC
  *           @arg @ref FL_RTCA_TIME_MARK_SECOND_REVERSE
  *           @arg @ref FL_RTCA_TIME_MARK_MINUTE_REVERSE
  *           @arg @ref FL_RTCA_TIME_MARK_HOUR_REVERSE
  *           @arg @ref FL_RTCA_TIME_MARK_DAY_REVERSE
  *           @arg @ref FL_RTCA_TIME_MARK_ALARM_REVERSE
  *           @arg @ref FL_RTCA_TIME_MARK_SEC
  */
__STATIC_INLINE uint32_t FL_RTCA_GetTimeMarkOutput(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->TMSEL, RTCA_TMSEL_TMSEL_Msk));
}

/**
  * @brief    Get RTCA Adjust Value
  * @rmtoll   ADJUST        FL_RTCA_ReadAdjustValue
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadAdjustValue(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ADJUST, (0x1ffU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCA Adjust Value
  * @rmtoll   ADJUST        FL_RTCA_WriteAdjustValue
  * @param    RTCAx RTCA instance
  * @param    adjustValue
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteAdjustValue(RTCA_Type *RTCAx, uint32_t adjustValue)
{
    MODIFY_REG(RTCAx->ADJUST, (0x1ffU << 0U), (adjustValue << 0U));
}

/**
  * @brief    Set RTCA Adjust Direction
  * @rmtoll   ADJUST    ADSIGN    FL_RTCA_SetAdjustDirection
  * @param    RTCAx RTCA instance
  * @param    adjustDir This parameter can be one of the following values:
  *           @arg @ref FL_RTCA_ADJUST_DIR_INCREASE
  *           @arg @ref FL_RTCA_ADJUST_DIR_DECREASE
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_SetAdjustDirection(RTCA_Type *RTCAx, uint32_t adjustDir)
{
    MODIFY_REG(RTCAx->ADJUST, RTCA_ADJUST_ADSIGN_Msk, adjustDir);
}

/**
  * @brief    Get RTCA Adjust Direction
  * @rmtoll   ADJUST    ADSIGN    FL_RTCA_GetAdjustDirection
  * @param    RTCAx RTCA instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_RTCA_ADJUST_DIR_INCREASE
  *           @arg @ref FL_RTCA_ADJUST_DIR_DECREASE
  */
__STATIC_INLINE uint32_t FL_RTCA_GetAdjustDirection(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->ADJUST, RTCA_ADJUST_ADSIGN_Msk));
}

/**
  * @brief    Get RTCA MilliSecond Counter Value
  * @rmtoll   SBSCNT        FL_RTCA_ReadMilliSecondCounter
  * @param    RTCAx RTCA instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCA_ReadMilliSecondCounter(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->SBSCNT, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCA MilliSecond Counter Value
  * @rmtoll   SBSCNT        FL_RTCA_WriteMilliSecondCounter
  * @param    RTCAx RTCA instance
  * @param    milliSecondCount
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_WriteMilliSecondCounter(RTCA_Type *RTCAx, uint32_t milliSecondCount)
{
    MODIFY_REG(RTCAx->SBSCNT, (0xffU << 0U), (milliSecondCount << 0U));
}

/**
  * @brief    RTCA enable
  * @rmtoll   CR    EN    FL_RTCA_Enable
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_Enable(RTCA_Type *RTCAx)
{
    SET_BIT(RTCAx->CR, RTCA_CR_EN_Msk);
}

/**
  * @brief    Get RTCA enable status
  * @rmtoll   CR    EN    FL_RTCA_IsEnabled
  * @param    RTCAx RTCA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCA_IsEnabled(RTCA_Type *RTCAx)
{
    return (uint32_t)(READ_BIT(RTCAx->CR, RTCA_CR_EN_Msk) == RTCA_CR_EN_Msk);
}

/**
  * @brief    RTCA disable
  * @rmtoll   CR    EN    FL_RTCA_Disable
  * @param    RTCAx RTCA instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCA_Disable(RTCA_Type *RTCAx)
{
    CLEAR_BIT(RTCAx->CR, RTCA_CR_EN_Msk);
}

/**
  * @}
  */

/** @defgroup RTCA_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_RTCA_DeInit(RTCA_Type *RTCAx);
void FL_RTCA_StructInit(FL_RTCA_InitTypeDef *initStruct);
FL_ErrorStatus FL_RTCA_GetTime(RTCA_Type *RTCAx, FL_RTCA_InitTypeDef *initStruct);
FL_ErrorStatus FL_RTCA_Init(RTCA_Type *RTCAx, FL_RTCA_InitTypeDef *initStruct);
FL_ErrorStatus FL_RTCA_ConfigTime(RTCA_Type *RTCAx, FL_RTCA_InitTypeDef *initStruct);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LG0XX_FL_RTCA_H*/

/*************************Py_Code_Generator Version: 0.1-0.11-0.1 @ 2020-09-14*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
